In [3]:
%reload_ext sql
%sql postgresql+psycopg2://postgres:postgres@localhost/demo

In [4]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## Window Function Value

#### LAG

In [7]:
%%sql
select * from EmployeeSalaries;

 * postgresql+psycopg2://postgres:***@localhost/demo
10 rows affected.

[(1, 'Alice', Decimal('5000.00'), 2023),
 (1, 'Alice', Decimal('5500.00'), 2024),
 (2, 'Bob', Decimal('4500.00'), 2023),
 (2, 'Bob', Decimal('4800.00'), 2024),
 (3, 'Charlie', Decimal('4000.00'), 2023),
 (3, 'Charlie', Decimal('4200.00'), 2024),
 (4, 'David', Decimal('4600.00'), 2023),
 (4, 'David', Decimal('4700.00'), 2024),
 (5, 'Eva', Decimal('5200.00'), 2023),
 (5, 'Eva', Decimal('5400.00'), 2024)]

In [12]:
%%sql
select EmployeeName,
Salary as current_salary,
year,
LAG(salary) over(partition by EmployeeID order by year) as previous_salary
from EmployeeSalaries;

 * postgresql+psycopg2://postgres:***@localhost/demo
10 rows affected.

[('Alice', Decimal('5000.00'), 2023, None),
 ('Alice', Decimal('5500.00'), 2024, Decimal('5000.00')),
 ('Bob', Decimal('4500.00'), 2023, None),
 ('Bob', Decimal('4800.00'), 2024, Decimal('4500.00')),
 ('Charlie', Decimal('4000.00'), 2023, None),
 ('Charlie', Decimal('4200.00'), 2024, Decimal('4000.00')),
 ('David', Decimal('4600.00'), 2023, None),
 ('David', Decimal('4700.00'), 2024, Decimal('4600.00')),
 ('Eva', Decimal('5200.00'), 2023, None),
 ('Eva', Decimal('5400.00'), 2024, Decimal('5200.00'))]

In [14]:
%%sql
select EmployeeName,
year,
Salary as current_salary,
LAG(salary) over(partition by EmployeeID order by year) as previous_salary,
salary - LAG(salary) over(partition by EmployeeID order by year) as increment
from EmployeeSalaries;

 * postgresql+psycopg2://postgres:***@localhost/demo
10 rows affected.

[('Alice', 2023, Decimal('5000.00'), None, None),
 ('Alice', 2024, Decimal('5500.00'), Decimal('5000.00'), Decimal('500.00')),
 ('Bob', 2023, Decimal('4500.00'), None, None),
 ('Bob', 2024, Decimal('4800.00'), Decimal('4500.00'), Decimal('300.00')),
 ('Charlie', 2023, Decimal('4000.00'), None, None),
 ('Charlie', 2024, Decimal('4200.00'), Decimal('4000.00'), Decimal('200.00')),
 ('David', 2023, Decimal('4600.00'), None, None),
 ('David', 2024, Decimal('4700.00'), Decimal('4600.00'), Decimal('100.00')),
 ('Eva', 2023, Decimal('5200.00'), None, None),
 ('Eva', 2024, Decimal('5400.00'), Decimal('5200.00'), Decimal('200.00'))]

#### LEAD

In [16]:
%%sql
select * from SalesData

 * postgresql+psycopg2://postgres:***@localhost/demo
5 rows affected.

[(1, 'Alice', Decimal('5000.00'), datetime.date(2025, 1, 1)),
 (2, 'Bob', Decimal('3000.00'), datetime.date(2025, 1, 2)),
 (3, 'Charlie', Decimal('4000.00'), datetime.date(2025, 1, 3)),
 (4, 'David', Decimal('4500.00'), datetime.date(2025, 1, 4)),
 (5, 'Eva', Decimal('5500.00'), datetime.date(2025, 1, 5))]

In [22]:
%%sql
select EmployeeName, SaleDate, SaleAmount,
LEAD(SaleAmount) over(order by SaleDate) as nextday_sale,
LEAD(SaleAmount) over(order by SaleDate) - SaleAmount as salediff
from SalesData;

 * postgresql+psycopg2://postgres:***@localhost/demo
5 rows affected.

[('Alice', datetime.date(2025, 1, 1), Decimal('5000.00'), Decimal('3000.00'), Decimal('-2000.00')),
 ('Bob', datetime.date(2025, 1, 2), Decimal('3000.00'), Decimal('4000.00'), Decimal('1000.00')),
 ('Charlie', datetime.date(2025, 1, 3), Decimal('4000.00'), Decimal('4500.00'), Decimal('500.00')),
 ('David', datetime.date(2025, 1, 4), Decimal('4500.00'), Decimal('5500.00'), Decimal('1000.00')),
 ('Eva', datetime.date(2025, 1, 5), Decimal('5500.00'), None, None)]

#### First Value

In [25]:
%%sql
select * from EmployeeSalaries;

 * postgresql+psycopg2://postgres:***@localhost/demo
13 rows affected.

[(1, 'Alice', Decimal('5000.00'), 2021),
 (1, 'Alice', Decimal('5500.00'), 2022),
 (1, 'Alice', Decimal('6000.00'), 2023),
 (1, 'Alice', Decimal('6500.00'), 2024),
 (1, 'Alice', Decimal('7000.00'), 2025),
 (2, 'Bob', Decimal('4500.00'), 2023),
 (2, 'Bob', Decimal('4800.00'), 2024),
 (3, 'Charlie', Decimal('4000.00'), 2023),
 (3, 'Charlie', Decimal('4200.00'), 2024),
 (4, 'David', Decimal('4600.00'), 2023),
 (4, 'David', Decimal('4700.00'), 2024),
 (5, 'Eva', Decimal('5200.00'), 2023),
 (5, 'Eva', Decimal('5400.00'), 2024)]

In [29]:
%%sql
select EmployeeName, year, Salary,
FIRST_VALUE(Salary) over(partition by EmployeeID order by year) as first_salary
from EmployeeSalaries;

 * postgresql+psycopg2://postgres:***@localhost/demo
13 rows affected.

[('Alice', 2021, Decimal('5000.00'), Decimal('5000.00')),
 ('Alice', 2022, Decimal('5500.00'), Decimal('5000.00')),
 ('Alice', 2023, Decimal('6000.00'), Decimal('5000.00')),
 ('Alice', 2024, Decimal('6500.00'), Decimal('5000.00')),
 ('Alice', 2025, Decimal('7000.00'), Decimal('5000.00')),
 ('Bob', 2023, Decimal('4500.00'), Decimal('4500.00')),
 ('Bob', 2024, Decimal('4800.00'), Decimal('4500.00')),
 ('Charlie', 2023, Decimal('4000.00'), Decimal('4000.00')),
 ('Charlie', 2024, Decimal('4200.00'), Decimal('4000.00')),
 ('David', 2023, Decimal('4600.00'), Decimal('4600.00')),
 ('David', 2024, Decimal('4700.00'), Decimal('4600.00')),
 ('Eva', 2023, Decimal('5200.00'), Decimal('5200.00')),
 ('Eva', 2024, Decimal('5400.00'), Decimal('5200.00'))]

#### LAst Value

In [35]:
%%sql
select EmployeeName, year, Salary,
LAST_VALUE(Salary) over(partition by EmployeeID order by year
                        ROWS BETWEEN CURRENT ROW and UNBOUNDED FOLLOWING) as latest_salary,
LAST_VALUE(Salary) over(partition by EmployeeID order by year
                        ROWS BETWEEN CURRENT ROW and UNBOUNDED FOLLOWING) - Salary as diff
from EmployeeSalaries;

 * postgresql+psycopg2://postgres:***@localhost/demo
13 rows affected.

[('Alice', 2021, Decimal('5000.00'), Decimal('7000.00'), Decimal('2000.00')),
 ('Alice', 2022, Decimal('5500.00'), Decimal('7000.00'), Decimal('1500.00')),
 ('Alice', 2023, Decimal('6000.00'), Decimal('7000.00'), Decimal('1000.00')),
 ('Alice', 2024, Decimal('6500.00'), Decimal('7000.00'), Decimal('500.00')),
 ('Alice', 2025, Decimal('7000.00'), Decimal('7000.00'), Decimal('0.00')),
 ('Bob', 2023, Decimal('4500.00'), Decimal('4800.00'), Decimal('300.00')),
 ('Bob', 2024, Decimal('4800.00'), Decimal('4800.00'), Decimal('0.00')),
 ('Charlie', 2023, Decimal('4000.00'), Decimal('4200.00'), Decimal('200.00')),
 ('Charlie', 2024, Decimal('4200.00'), Decimal('4200.00'), Decimal('0.00')),
 ('David', 2023, Decimal('4600.00'), Decimal('4700.00'), Decimal('100.00')),
 ('David', 2024, Decimal('4700.00'), Decimal('4700.00'), Decimal('0.00')),
 ('Eva', 2023, Decimal('5200.00'), Decimal('5400.00'), Decimal('200.00')),
 ('Eva', 2024, Decimal('5400.00'), Decimal('5400.00'), Decimal('0.00'))]

#### Nth Value

In [41]:
%%sql
select *,
NTH_VALUE(Salary, 3) over(partition by year order by Salary
                          ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) as ThirdBigSalary
from EmployeeSalaries
order by year;

 * postgresql+psycopg2://postgres:***@localhost/demo
13 rows affected.

[(1, 'Alice', Decimal('5000.00'), 2021, None),
 (1, 'Alice', Decimal('5500.00'), 2022, None),
 (3, 'Charlie', Decimal('4000.00'), 2023, Decimal('4600.00')),
 (2, 'Bob', Decimal('4500.00'), 2023, Decimal('4600.00')),
 (4, 'David', Decimal('4600.00'), 2023, Decimal('4600.00')),
 (5, 'Eva', Decimal('5200.00'), 2023, Decimal('4600.00')),
 (1, 'Alice', Decimal('6000.00'), 2023, Decimal('4600.00')),
 (3, 'Charlie', Decimal('4200.00'), 2024, Decimal('4800.00')),
 (4, 'David', Decimal('4700.00'), 2024, Decimal('4800.00')),
 (2, 'Bob', Decimal('4800.00'), 2024, Decimal('4800.00')),
 (5, 'Eva', Decimal('5400.00'), 2024, Decimal('4800.00')),
 (1, 'Alice', Decimal('6500.00'), 2024, Decimal('4800.00')),
 (1, 'Alice', Decimal('7000.00'), 2025, None)]